// 표현식 (expression) : 평가(evaluation:코드를 해석해서 실행)해서 하나의 값이 될 수 있는 문장
//                                코드상에서 값이 필요한 곳에 표현식을 사용하는 건 가능하지만
//                                표현식이 아닌 문장을 사용하는 건 불가능

// 1+2+3>5 => true라는 값이 되는 표현식
if (1+2+3 > 5) {
    console.log('5보다 큽니다!');
} else {
    console.log('5보다 크지 않습니다!');
}

// if (let l=1;) { // 표현식이 아닌 문장은 표현식의 자리에 사용할 수 없음, SyntaxError
//     console.log('???');
// }

let l1 = 100; // 전체는 선언문인 문장, 100은 숫자리터럴이면서 표현식

// 전체는 선언문인 문장, 1+2+3+4+5은 결과가 값이 되는 표현식
// 1 2 3 4 5 : 숫자리터럴, + : 연산자, 1+2+3+4+5는 숫자리터럴과 연산자의 조합인 문장
let l2 = 1 + 2 + 3 + 4 + 5; 

// 함수 선언문
function add(a, b) {
    return a + b;
}

// 함수리터럴 : 코드로 쓴 함수값
if (function add(a, b) {return a + b;}) {
}

// 함수리터럴은 값이므로 변수에 할당 가능
let func = function add(a, b) {return a + b;};
console.log(func); // func변수에는 함수리터럴이 담겨 있음
console.log(func(1,2)); // 함수리터럴을 통해 함수 호출이 가능

// 자바스크립트에서 모든 것은 값이다!

// 자바스크립트는 문법체계를 가진 문자열들의 집합!

// 자바스크립트에서는 함수에 함수를 전달하는 것이 가능!