// 별찍기

// 1. 직각삼각형
// *
// **
// ***
// ****
// *****
// i=0, j=0
// i=1, j=0,1
// i=2, j=0,1,2
// i=3, j=0,1,2,3
// i=4, j=0,1,2,3,4
for (let i=0; i<5; i++) { // 줄의 수
    for (let j=0; j<i+1; j++) { // 별의 수
        process.stdout.write('*');
    }
    console.log();
}

console.log();

// 2. 역직각삼각형
// *****
// ****
// ***
// **
// *
// i=0, j=0,1,2,3,4
// i=1, j=0,1,2,3
// i=2, j=0,1,2
// i=3, j=0,1
// i=4, j=0
for (let i=0; i<5; i++) { // 줄의 수
    for (let j=0; j<5-i; j++) { // 별의 수
        process.stdout.write('*');
    }
    console.log();
}

console.log();

// 3. 역직각우삼각형
// *****
// 0****
// 00***
// 000**
// 0000*
// i:줄의 수, j:별의 수, k:0의 수
// i=0  j=0,1,2,3,4 k=
// i=1  j=0,1,2,3    k=0
// i=2  j=0,1,2       k=0,1
// i=3  j=0,1          k=0,1,2
// i=4  j=0,            k=0,1,2,3
for (let i=0; i<5; i++) { // 줄의 수
    for (let k=0; k<i; k++) { // 0의 수
        process.stdout.write('0');
    }
    for (let j=0; j<5-i; j++) { // 별의 수
        process.stdout.write('*');
    }
    console.log();
}

console.log();

// 4. 이등변삼각형
// 0000*
// 000***
// 00*****
// 0*******
// *********
// i=0  j=0                         k=0,1,2,3
// i=1  j=0,1,2                    k=0,1,2
// i=2  j=0,1,2,3,4              k=0,1
// i=3  j=0,1,2,3,4,5,6         k=0
// i=4  j=0, 1,2,3,4,5,6,7,8  k=
// j는 2*i+1보다 작은동안 반복
// k는 4-i보다 작은 동안 반복
for (let i=0; i<5; i++) { // 줄의 수
    for (let k=0; k<4-i; k++) { // 0의 수
        process.stdout.write('0');
    }
    for (let j=0; j<2*i+1; j++) { // 별의 수
        process.stdout.write('*');
    }
    console.log();
}

console.log();

// 5. 역이등변삼각형
// *********
// 0*******
// 00*****
// 000***
// 0000*
// i=5  j=0,1,2,3,4,5,6,7,8  k=
// i=4  j=0,1,2,3,4,5,6        k=0
// i=3  j=0,1,2,3,4              k=0,1
// i=2  j=0,1,2                    k=0,1,2
// i=1  j=0                          k=0,1,2,3
// j는 2*i-1보다 작은동안 반복
// k는 5-i보다 작은 동안 반복
for (let i=5; i>0; i--) { // 줄의 수
    for (let k=0; k<5-i; k++) { // 0의 수
        process.stdout.write('0');
    }
    for (let j=0; j<2*i-1; j++) { // 별의 수
        process.stdout.write('*');
    }
    console.log();
}

console.log();

// 6. 9by9 box
// *********
// *0000000*
// *0000000*
// *0000000*
// *0000000*
// *0000000*
// *0000000*
// *0000000*
// *********
// i가 행, j가 열
// 첫 행과 마지막 행에서 i는 0, 8 => 8로 나눈 나머지가 0
// 첫 열과 마지막 열에서 j는 0, 8 => 8로 나눈 나머지가 0
for (let i=0; i<9; i++) { // 행
    for (let j=0; j<9; j++) { // 열
        if (i%8==0 || j%8==0) process.stdout.write('*');
        else process.stdout.write('0');
    }
    console.log();
}

console.log();

// 7. 9by9 X
// *0000000*
// 0*00000*0
// 00*000*00
// 000*0*000
// 0000*0000
// 000*0*000
// 00*000*00
// 0*00000*0
// *0000000*
for (let i=0; i<9; i++) {
    for (let j=0; j<9; j++) {
        if (i==j || (8-i)==j) process.stdout.write('*');
        else process.stdout.write('0');
    }
    console.log();    
}

console.log();

// 8. 9by9 box X
// *********
// **00000**
// *0*000*0*
// *00*0*00*
// *000*000*
// *00*0*00*
// *0*000*0*
// **00000**
// *********
for (let i=0; i<9; i++) {
    for (let j=0; j<9; j++) {
        if (i%8==0 || j%8==0 || i==j || (8-i)==j) process.stdout.write('*');
        else process.stdout.write('0');
    }
    console.log();    
}

console.log();

// 9. 9by9 diamond
// 0000*0000
// 000***000
// 00*****00
// 0*******0
// *********
// 0*******0
// 00*****00
// 000***000
// 0000*0000

console.log();

// 10. 9by9 butterfly
// 000000000
// *0000000*
// **00000**
// ***000***
// ****0****
// ***000***
// **00000**
// *0000000*
// 000000000

console.log();

































